# frozen_string_literal: true
module ToRussianWords
  module Divisions
    NOMINATIVE_DIVISIONS = [
      ([''] * 10),
      ['тысяч', 'тысяча', (['тысячи'] * 3),  (['тысяч'] * 5)].flatten,
      ['миллионов', 'миллион', (['миллиона'] * 3),  (['миллионов'] * 5)].flatten,
      ['миллиардов', 'миллиард', (['миллиарда'] * 3),  (['миллиардов'] * 5)].flatten,
      ['триллионов', 'триллион', (['триллиона'] * 3),  (['триллионов'] * 5)].flatten,
      ['квадрильонов', 'квадрильон', (['квадрильона'] * 3),  (['квадрильонов'] * 5)].flatten,
      ['нониллионов', 'нониллион', (['нониллиона'] * 3),  (['нониллионов'] * 5)].flatten
    ].freeze

    DATIVE_DIVISIONS = [
      ([''] * 10),
      ['тысяч', 'тысячи', (['тысяч'] * 8)].flatten,
      ['миллионов', 'миллиона', (['миллионов'] * 8)].flatten,
      ['миллиардов', 'миллиарда', (['миллиардов'] * 8)].flatten,
      ['триллионов', 'триллиона', (['триллионов'] * 8)].flatten,
      ['квадрильонов', 'квадрильона', (['квадрильонов'] * 8)].flatten,
      ['нониллионов', 'нониллиона', (['нониллионов'] * 8)].flatten,
    ].freeze
  end
end
