# frozen_string_literal: true

module ToRussianWords
  module RussianGenderLabels
    NOMINATIVE_RUSSIAN_FEMALE_LABEL = {
      1 => "одна",
      2 => "две",

      21 => "двадцать одна",
      22 => "двадцать две",

      31 => "тридцать одна",
      32 => "тридцать две",

      41 => "сорок одна",
      42 => "сорок две",

      51 => "пятьдесят одна",
      52 => "пятьдесят две",

      61 => "шестьдесят одна",
      62 => "шестьдесят две",

      71 => "семьдесят одна",
      72 => "семьдесят две",

      81 => "восемьдесят одна",
      82 => "восемьдесят две",

      91 => "девяносто одна",
      92 => "девяносто две",

    }.freeze

    DATIVE_RUSSIAN_FEMALE_LABEL = {
      0 => "",
      1 => "одной",
      2 => "двух",

      21 => "двадцати одной",
      22 => "двадцати двух",

      31 => "тридцати одной",
      32 => "тридцати двух",

      41 => "сорока одной",
      42 => "сорока двух",

      51 => "пятидесяти одной",
      52 => "пятидесяти двух",

      61 => "шестидесяти одной",
      62 => "шестидесяти двух",

      71 => "семидесяти одной",
      72 => "семидесяти двух",

      81 => "восьмидесяти одной",
      82 => "восьмидесяти двух",

      91 => "девяноста одной",
      92 => "девяноста двух",
    }.freeze
  end
end
